Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad
Serialization structure for AnalysisDecomposedBarLoad.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad.AnalysisDecomposedLoad
The analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad._CSCode
The CS code of the analysis decomposed bar load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad._StartDistance
The start distance of the analysis decomposed bar load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad._EndDistance
The end distance of the analysis decomposed bar load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad._StartValue
The start value of the analysis decomposed bar load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad._EndValue
The end value of the analysis decomposed bar load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad.ToStruct(Tekla.Structures.Analysis.AnalysisDecomposedBarLoad)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad.FromStruct(Tekla.Structures.Analysis.AnalysisDecomposedBarLoad)
DO NOT USE! For internal usage only!
P: P.